  {
    "name": "PolarSys Attributes",
    "version": "1.0.1",
    "children": [
      {
        "name": "Project Quality",
        "mnemo": "QM_QUALITY",
        "desc": [
            "The overall quality of the project. In the context of embedded software, this is often assimilated to Maturity."
        ]
      },
      {
        "name": "Ecosystem",
        "mnemo": "QM_ECOSYSTEM",
        "desc" : [
            "The degree of maturity for the ecosystem evolving around the project: is it active, diversified, responsive?"
        ]
      },
      {
        "name": "Process",
        "mnemo": "QM_PROCESS",
        "desc" : [
            "The complexity of the data flow structure in the code functions."
        ]
      },
      {
        "name": "Product",
        "mnemo": "QM_PRODUCT",
        "desc" : [
            "The complexity of the object-oriented architecture and structure. Composed of MDIT (maximum depth of inheritance tree)."
        ]
      },
      {
        "name": "Activity",
        "mnemo": "QM_ACTIVITY",
        "desc" : [
            "How active is the project ecosystem? Are there a lot of actions and events happening?"
        ]
      },
      {
        "name": "Diversity",
        "mnemo": "QM_DIVERSITY",
        "desc" : [
            "How diverse is the project ecosystem? Are there enough different actors to ensure its sustainability?"
        ]
      },
      {
        "name": "Responsiveness",
        "mnemo": "QM_RESPONSIVENESS",
        "desc" : [
            "How fast people get an answer when they have a problem working with the project?"
        ]
      },
      {
        "name": "Support",
        "mnemo": "QM_SUPPORT",
        "desc" : [
            "What is the amount of knowledge answered when someone requires help?"
        ]
      },      {
        "name": "Visibility",
        "mnemo": "QM_VISIBILITY",
        "desc" : [
            "Do people talk about the software? Are there research articles, journal articles, and conference presentations?"
        ]
      },
      {
        "name": "Usage",
        "mnemo": "QM_USAGE",
        "desc" : [
            "The degree of usage of the project: is it widely used, by different people in different context?"
        ]
      },      {
        "name": "User feedback",
        "mnemo": "QM_FEEDBACK",
        "desc" : [
            "How do the users of the software evaluate the project and product?"
        ]
      },
      {
        "name": "Configuration Management",
        "mnemo": "QM_SCM",
        "desc" : [
            "Do the project applies best practices regarding software configuration management?"
        ]
      },      {
        "name": "Change Management",
        "mnemo": "QM_ITS",
        "desc" : [
            "Do the project applies best practices regarding change management?"
        ]
      },
      {
        "name": "Intellectual Property Management",
        "mnemo": "QM_IP",
        "desc" : [
            "How is intellectual property handled in the project? Is there an IP log? Are the project and the Eclipse Foundation safe regarding IP?"
        ]
      },
      {
        "name": "Planning Management",
        "mnemo": "QM_PLAN",
        "desc" : [
            "Is the project behaviour predicable? Are outputs delivered on planned time and quality?"
        ]
      },
      {
        "name": "Test Management",
        "mnemo": "QM_TST",
        "desc" : [
            "Is the product thoroughly tested? How many tests are there, what is the code coverage?"
        ]
      },
      {
        "name": "Analysability",
        "mnemo": "QM_ANA",
        "desc" : [
            "Degree of effectiveness and efficiency with which it is possible to assess the impact on a product or system of an intended change to one or more of its parts, or to diagnose a product for deficiencies or causes of failures, or to identify parts to be modified. (ISO/IEC 25010)"
        ]
      },
      {
        "name": "Changeability",
        "mnemo": "QM_CHA",
        "desc" : [
            "Degree to which a product or system can be effectively and efficiently modified without introducing defects or degrading existing product quality. (ISO/IEC 25010)"
        ]
      },
      {
        "name": "Reliability",
        "mnemo": "QM_REL",
        "desc" : [
            "Degree to which a system, product or component performs specified functions under specified conditions for a specified period of time. (ISO/IEC 25010)"
        ]
      },
      {
        "name": "Reusability",
        "mnemo": "QM_REU",
        "desc" : [
            "Degree to which an asset can be used in more than one system, or in building other assets. (ISO/IEC 25010)"
        ]
      }
    ]
  }
